AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/dma.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2012, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
//dma.c - Driver for the DMA Module.
//
//*****************************************************************************
#include "inc/hw_regaccess.h"
#include "dma.h"
#ifdef  __IAR_SYSTEMS_ICC__
#include "deprecated/IAR/msp430xgeneric.h"
#else
#include "deprecated/CCS/msp430xgeneric.h"
#endif
#include "assert.h"

//*****************************************************************************
//
//! Initializes the specified DMA channel.
//!
//! \param baseAddress is the base address of the DMA module.
//! \param channelSelect is the specified channel to initialize.
//!        Valid values are
//!        \b DMA_CHANNEL_0
//!        \b DMA_CHANNEL_1
//!        \b DMA_CHANNEL_2
//!        \b DMA_CHANNEL_3
//!        \b DMA_CHANNEL_4
//!        \b DMA_CHANNEL_5
//!        \b DMA_CHANNEL_6
//!        \b DMA_CHANNEL_7
//! \param transferModeSelect is the transfer mode of the selected channel.
//!        Valid values are
//!        \b DMA_TRANSFER_SINGLE - Single transfer, transfers disabled after
//!             transferAmount of transfers. [Default]
//!        \b DMA_TRANSFER_BLOCK - Multiple transfers of transferAmount,
//!             transfers disabled once finished.
//!        \b DMA_TRANSFER_BURSTBLOCK - Multiple transfers of transferAmount
//!             interleaved with CPU activity, transfers disabled once finished.
//!        \b DMA_TRANSFER_REPEATED_SINGLE - Repeated single transfer by trigger.
//!        \b DMA_TRANSFER_REPEATED_BLOCK - Multiple transfers of transferAmount
//!             by trigger.
//!        \b DMA_TRANSFER_REPEATED_BURSTBLOCK - Multiple transfers of
//!             transferAmount by trigger interleaved with CPU activity.
//!        Modified bits are \b DMADT of \b DMAxCTL register.
//! \param transferSize is the amount of transfers to complete in a block
//!       transfer mode, as well as how many transfers to complete before the
//!       interrupt flag is set. Valid value is between 1-65535, if 0, no
//!       transfers will occur.
//!        Modified bits are \b DMAxSZ of \b DMAzSZ register.
//! \param triggerSourceSelect is the source that will trigger the start of each
//!       transfer, note that the sources are device specific.
//!        Valid values are
//!        \b DMA_TRIGGERSOURCE_0 [Default]
//!        \b DMA_TRIGGERSOURCE_1
//!        \b DMA_TRIGGERSOURCE_2
//!        \b DMA_TRIGGERSOURCE_3
//!        \b DMA_TRIGGERSOURCE_4
//!        \b DMA_TRIGGERSOURCE_5
//!        \b DMA_TRIGGERSOURCE_6
//!        \b DMA_TRIGGERSOURCE_7
//!        \b DMA_TRIGGERSOURCE_8
//!        \b DMA_TRIGGERSOURCE_9
//!        \b DMA_TRIGGERSOURCE_10
//!        \b DMA_TRIGGERSOURCE_11
//!        \b DMA_TRIGGERSOURCE_12
//!        \b DMA_TRIGGERSOURCE_13
//!        \b DMA_TRIGGERSOURCE_14
//!        \b DMA_TRIGGERSOURCE_15
//!        \b DMA_TRIGGERSOURCE_16
//!        \b DMA_TRIGGERSOURCE_17
//!        \b DMA_TRIGGERSOURCE_18
//!        \b DMA_TRIGGERSOURCE_19
//!        \b DMA_TRIGGERSOURCE_20
//!        \b DMA_TRIGGERSOURCE_21
//!        \b DMA_TRIGGERSOURCE_22
//!        \b DMA_TRIGGERSOURCE_23
//!        \b DMA_TRIGGERSOURCE_24
//!        \b DMA_TRIGGERSOURCE_25
//!        \b DMA_TRIGGERSOURCE_26
//!        \b DMA_TRIGGERSOURCE_27
//!        \b DMA_TRIGGERSOURCE_28
//!        \b DMA_TRIGGERSOURCE_29
//!        \b DMA_TRIGGERSOURCE_30
//!        \b DMA_TRIGGERSOURCE_31
//!        This parameter is device specific and trigger sources should be
//!        found in device's datasheet.
//!        Modified bits are \b DMAxTSEL of \b DMACTLx register.
//! \param transferUnitSelect is the specified size of transfers.
//!        Valid values are
//!        \b DMA_UNIT_SRCWORD_DSTWORD [Default]
//!        \b DMA_UNIT_SRCBYTE_DSTWORD
//!        \b DMA_UNIT_SRCWORD_DSTBYTE
//!        \b DMA_UNIT_SRCBYTE_DSTBYTE
//!        Modified bits are \b DMADSTBYTE and \b DMASRCBYTE of \b DMAxCTL register.
//! \param triggerTypeSelect is the type of trigger that the trigger signal
//!       needs to be to start a transfer.
//!        Valid values are
//!        \b DMA_TRIGGER_RISINGEDGE [Default]
//!        \b DMA_TRIGGER_HIGH - A trigger would be a high signal from the
//!             trigger source, to be held high through the length of the
//!             transfer(s).
//!        Modified bits are \b DMALEVEL of \b DMAxCTL register.
//!
//! This function initializes the specified DMA channel. Upon successful
//! completion of initializtion of the selected channel the control registers
//! will be cleared and the given variables will be set. Please note, if
//! tranfers have been enabled with the enableTransfers() function, then a call
//! to disableTransfers() is necessary before re-initialization. Also note, that
//! the trigger sources are device dependent and can be found in the device
//! family data sheet. The amount of DMA channels available are also device
//! specific.
//!
//! \return STATUS_SUCCESS or STATUS_FAILURE of the initialization process.
//
//*****************************************************************************
unsigned short DMA_init (uint32_t baseAddress,
    uint8_t channelSelect,
    uint16_t transferModeSelect,
    uint16_t transferSize,
    uint8_t triggerSourceSelect,
    uint8_t transferUnitSelect,
    uint8_t triggerTypeSelect)
{
    assert(channelSelect <= DMA_CHANNEL_7);
    assert(transferModeSelect <= DMA_TRANSFER_REPEATED_BURSTBLOCK);
    assert(triggerSourceSelect <= DMA_TRIGGERSOURCE_31);
    assert(transferUnitSelect <= DMA_SIZE_SRCBYTE_DSTBYTE);
    assert(triggerTypeSelect <= DMA_TRIGGER_HIGH);

    uint8_t retVal = STATUS_SUCCESS;
    uint8_t triggerOffset = (channelSelect >> 4);

    //Reset and Set DMA Control 0 Register
    HWREG16(baseAddress + channelSelect + OFS_DMA0CTL) =
        transferModeSelect //Set Transfer Mode
        + transferUnitSelect //Set Transfer Unit Size
        + triggerTypeSelect; //Set Trigger Type

    //Set Transfer Size Amount
    HWREG16(baseAddress + channelSelect + OFS_DMA0SZ) = transferSize;

    if (triggerOffset & 0x01){   //Odd Channel
        HWREG16(baseAddress + (triggerOffset & 0x0E)) &= 0x00FF; //Reset Trigger Select
        HWREG16(baseAddress +
            (triggerOffset & 0x0E)) |= (triggerSourceSelect << 8);
    } else   { //Even Channel
        HWREG16(baseAddress + (triggerOffset & 0x0E)) &= 0xFF00; //Reset Trigger Select
        HWREG16(baseAddress + (triggerOffset & 0x0E)) |= triggerSourceSelect;
    }

