AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/dma.c
    return ( retVal) ;
}

//*****************************************************************************
//
//! Sets the specified amount of transfers for the selected DMA channel.
//!
//! \param baseAddress is the base address of the DMA module.
//! \param channelSelect is the specified channel to set source address
//!       direction for.
//!        Valid values are
//!        \b DMA_CHANNEL_0
//!        \b DMA_CHANNEL_1
//!        \b DMA_CHANNEL_2
//!        \b DMA_CHANNEL_3
//!        \b DMA_CHANNEL_4
//!        \b DMA_CHANNEL_5
//!        \b DMA_CHANNEL_6
//!        \b DMA_CHANNEL_7
//! \param transferSize is the amount of transfers to complete in a block
//!       transfer mode, as well as how many transfers to complete before the
//!       interrupt flag is set. Valid value is between 1-65535, if 0, no
//!       transfers will occur.
//!        Modified bits are \b DMAxSZ of \b DMAxSZ register.
//!
//! This function sets the specified amount of transfers for the selected DMA
//! channel without having to reinitialize the DMA channel.
//!
//! \return NONE
//
//*****************************************************************************
void DMA_setTransferSize (uint32_t baseAddress,
    uint8_t channelSelect,
    uint16_t transferSize)
{
    //Set Transfer Size Amount
    HWREG16(baseAddress + channelSelect + OFS_DMA0SZ) = transferSize;
}

//*****************************************************************************
//
//! Sets source address and the direction that the source address will move
//! after a transfer.
//!
//! \param baseAddress is the base address of the DMA module.
//! \param channelSelect is the specified channel to set source address
//!       direction for.
//!        Valid values are
//!        \b DMA_CHANNEL_0
//!        \b DMA_CHANNEL_1
//!        \b DMA_CHANNEL_2
//!        \b DMA_CHANNEL_3
//!        \b DMA_CHANNEL_4
//!        \b DMA_CHANNEL_5
//!        \b DMA_CHANNEL_6
//!        \b DMA_CHANNEL_7
//! \param srcAddress is the address of where the data will be transfered from.
//!        Modified bits are \b DMAxSA of \b DMAxSA register.
//! \param directionSelect is the specified direction of the source address
//!       after a transfer.
//!        Valid values are
//!        \b DMA_DIRECTION_UNCHANGED
//!        \b DMA_DIRECTION_DECREMENT
//!        \b DMA_DIRECTION_INCREMENT
//!        Modified bits are \b DMASRCINCR of \b DMAxCTL register.
//!
//! This function sets the source address and the direction that the source
//! address will move after a transfer is complete. It may be incremented,
//! decremented, or unchanged.
//!
//! \return NONE
//
//*****************************************************************************
void DMA_setSrcAddress (uint32_t baseAddress,
    uint8_t channelSelect,
    uint32_t srcAddress,
    uint16_t directionSelect)
{
    assert(channelSelect <= DMA_CHANNEL_7);
    assert(directionSelect <= DMA_DIRECTION_INCREMENT);

    //Set the Source Address
    __data16_write_addr((unsigned short)(baseAddress + channelSelect + DMA0SA_O),
        srcAddress);

    //Reset bits before setting them
    HWREG16(baseAddress + channelSelect + OFS_DMA0CTL) &= ~(DMASRCINCR_3);
    HWREG16(baseAddress + channelSelect + OFS_DMA0CTL) |= directionSelect;
}

//*****************************************************************************
//
//! Sets the destination address and the direction that the destination address
//! will move after a transfer.
//!
//! \param baseAddress is the base address of the DMA module.
//! \param channelSelect is the specified channel to set the destination address
//!       direction for.
//!        Valid values are
//!        \b DMA_CHANNEL_0
//!        \b DMA_CHANNEL_1
//!        \b DMA_CHANNEL_2
//!        \b DMA_CHANNEL_3
//!        \b DMA_CHANNEL_4
//!        \b DMA_CHANNEL_5
//!        \b DMA_CHANNEL_6
//!        \b DMA_CHANNEL_7
//! \param dstAddress is the address of where the data will be transfered to.
//!        Modified bits are \b DMAxDA of \b DMAxDA register.
//! \param directionSelect is the specified direction of the destination address
//!       after a transfer.
//!        Valid values are
//!        \b DMA_DIRECTION_UNCHANGED
//!        \b DMA_DIRECTION_DECREMENT
//!        \b DMA_DIRECTION_INCREMENT
//!        Modified bits are \b DMADSTINCR of \b DMAxCTL register.
//!
//! This function sets the destination address and the direction that the
//! destination address will move after a transfer is complete. It may be
//! incremented, decremented, or unchanged.
//!
//! \return NONE
//
//*****************************************************************************
void DMA_setDstAddress (uint32_t baseAddress,
    uint8_t channelSelect,
    uint32_t dstAddress,
    uint16_t directionSelect)
{
    assert(channelSelect <= DMA_CHANNEL_7);
    assert(directionSelect <= DMA_DIRECTION_INCREMENT);

    //Set the Destination Address
    __data16_write_addr((unsigned short)(baseAddress + channelSelect + DMA0DA_O),
        dstAddress);

    //Reset bits before setting them
    HWREG16(baseAddress + channelSelect + OFS_DMA0CTL) &= ~(DMADSTINCR_3);
    HWREG16(baseAddress + channelSelect + OFS_DMA0CTL) |= (directionSelect << 2);
}

//*****************************************************************************
//
//! Enables transfers to be triggered.
//!
//! \param baseAddress is the base address of the DMA module.
//! \param channelSelect is the specified channel to enable transfer for.
//!        Valid values are
//!        \b DMA_CHANNEL_0
//!        \b DMA_CHANNEL_1
//!        \b DMA_CHANNEL_2
//!        \b DMA_CHANNEL_3
//!        \b DMA_CHANNEL_4
//!        \b DMA_CHANNEL_5
//!        \b DMA_CHANNEL_6
//!        \b DMA_CHANNEL_7
//!
//! This function enables transfers upon appropriate trigger of the selected
//! trigger source for the selected channel.
//!
//! \return NONE
//
//*****************************************************************************
void DMA_enableTransfers (uint32_t baseAddress,
    uint8_t channelSelect)
{
    assert(channelSelect <= DMA_CHANNEL_7);

