AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/dma.c
    if (HWREG16(baseAddress + channelSelect + OFS_DMA0CTL) & DMAABORT){
        return ( DMA_ABORTED) ;
    } else   {
        return ( DMA_NOTABORTED) ;
    }
}

//*****************************************************************************
//
//! Clears the status of the NMIAbort to proceed with transfers for the selected
//! channel.
//!
//! \param baseAddress is the base address of the DMA module.
//! \param channelSelect is the specified channel to clear the NMI Abort flag
//!       for.
//!        Valid values are
//!        \b DMA_CHANNEL_0
//!        \b DMA_CHANNEL_1
//!        \b DMA_CHANNEL_2
//!        \b DMA_CHANNEL_3
//!        \b DMA_CHANNEL_4
//!        \b DMA_CHANNEL_5
//!        \b DMA_CHANNEL_6
//!        \b DMA_CHANNEL_7
//!
//! This function clears the status of the NMI Abort flag for the selected
//! channel to allow for transfers on the channel to continue.
//!
//! \return NONE
//
//*****************************************************************************
void DMA_clearNMIAbort (uint32_t baseAddress,
    uint8_t channelSelect)
{
    assert(channelSelect <= DMA_CHANNEL_7);

    HWREG16(baseAddress + channelSelect + OFS_DMA0CTL) &= ~(DMAABORT);
}

//*****************************************************************************
//
//! Disables the DMA from stopping the CPU during a Read-Modify-Write Operation
//! to start a transfer.
//!
//! \param baseAddress is the base address of the DMA module.
//!
//! This function allows the CPU to finish any read-modify-write operations it
//! may be in the middle of before transfers of and DMA channel stop the CPU.
//!
//! \return NONE
//
//*****************************************************************************
void DMA_disableTransferDuringReadModifyWrite (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_DMACTL4) |= DMARMWDIS;
}

//*****************************************************************************
//
//! Enables the DMA to stop the CPU during a Read-Modify-Write Operation
//! to start a transfer.
//!
//! \param baseAddress is the base address of the DMA module.
//!
//! This function allows the DMA to stop the CPU in the middle of a
//! read-modify-write operation to transfer data. (default)
//!
//! \return NONE
//
//*****************************************************************************
void DMA_enableTransferDuringReadModifyWrite (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_DMACTL4) &= ~(DMARMWDIS);
}

//*****************************************************************************
//
//! Enables Round Robin prioritzation.
//!
//! \param baseAddress is the base address of the DMA module.
//!
//! This function enables Round Robin Prioritization of DMA channels. In the
//! case of Round Robin Prioritization, the last DMA channel to have transfered
//! data then has the last priority, which comes into play when multiple DMA
//! channels are ready to transfer at the same time.
//!
//! \return NONE
//
//*****************************************************************************
void DMA_enableRoundRobinPriority (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_DMACTL4) |= ROUNDROBIN;
}

//*****************************************************************************
//
//! Disables Round Robin prioritzation.
//!
//! \param baseAddress is the base address of the DMA module.
//!
//! This function disables Round Robin Prioritization, enabling static
//! prioritization of the DMA channels. In static prioritization, the DMA
//! channels are prioritized with the lowest DMA channel index having the
//! highest priority (i.e. DMA Channel 0 has the highest priority). (default)
//!
//! \return NONE
//
//*****************************************************************************
void DMA_disableRoundRobinPriority (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_DMACTL4) &= ~(ROUNDROBIN);
}

//*****************************************************************************
//
//! Enables a NMI to interrupt a DMA transfer.
//!
//! \param baseAddress is the base address of the DMA module.
//!
//! This function allow NMI's to interrupting any DMA transfer currently in
//! progress and stops any future transfers to begin before the NMI is done
//! processing.
//!
//! \return NONE
//
//*****************************************************************************
void DMA_enableNMIAbort (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_DMACTL4) |= ENNMI;
}

//*****************************************************************************
//
//! Disables any NMI from interrupting a DMA transfer.
//!
//! \param baseAddress is the base address of the DMA module.
//!
//! This function disables NMI's from interrupting any DMA transfer currently in
//! progress. (default)
//!
//! \return NONE
//
//*****************************************************************************
void DMA_disableNMIAbort (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_DMACTL4) &= ~(ENNMI);
}

//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************
